app/controllers/orders_controller.rb

SELECT "order_books".* FROM "order_books"
---
    def index
        render json: OrderBook.all

INSERT INTO "order_books" ("instrument_name", "quantity", "order_type", "status", "created_at", "updated_at") VALUES ('BTC-USDT', 1.202, 'market', 'open', '2025-08-11 04:04:04.868727', '2025-08-11 04:04:04.868727') RETURNING "id"
---
    def create
        @new_order = OrderBook.new(order_params)
        if @new_order.save

SELECT "order_books".* FROM "order_books" WHERE "order_books"."id" = 1 LIMIT 1
---
        def get_order_detail
            @order_detail = OrderBook.find(params[:id])