app/controllers/prices_controller.rb

        def get_instrument_detail
            @instrument_detail = CryptoPrice.where(instrument_name: params[:id]).order(timestamp: :desc).first
---
SELECT "crypto_prices".* FROM "crypto_prices" WHERE "crypto_prices"."instrument_name" = 'BTC-USDT' ORDER BY "crypto_prices"."timestamp" DESC LIMIT 1