app/controllers/prices_controller.rb

SELECT "crypto_prices".* FROM "crypto_prices"
---
    def index
        render json: CryptoPrice.all

INSERT INTO "crypto_prices" ("instrument_name", "price", "timestamp", "created_at", "updated_at") VALUES ('BTC-USDT', 45000.5, '2025-08-11 04:13:51.936895', '2025-08-11 04:13:51.939118', '2025-08-11 04:13:51.939118') RETURNING "id"
---
    def create
        @instrument = CryptoPrice.new(
            instrument_name: params[:instrument_name],
            price: params[:price],
            timestamp: Time.current
        )

        p "test1"

        if @instrument.save